system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          0.5;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
    forces
    {
        type            forces;
        libs            (forces);
        patches         (hull);
        rhoInf          998.8;
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        CofR            (165.719 0 11.31);
    }
	yPlus1
	{
		// Mandatory entries (unmodifiable)
		type            yPlus;
		libs            (fieldFunctionObjects);

		// Optional (inherited) entries
		writePrecision  6;
		writeToFile     true;
		useUserTime     true;
		region          region0;
		enabled         true;
		log             true;
		timeStart       0;
		timeEnd         10000;
		executeControl  timeStep;
		executeInterval 1000;
		writeControl    timeStep;
		writeInterval   1000;
	}
}


// ************************************************************************* //
